tests/tools/artillery/stressTests/id_lookup/gcp.itemByID.yml
config:
  target: 'http://34.68.90.97:3002'
  payload:
    # path is relative to the location of the test script
    path: '../../dbSample.csv'
    fields:
      - 'itemId'
      - 'itemName'
  http:
    pool: 10
  phases:
    - duration: 60
      arrivalRate: 50
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
      - get:
          url: '/items/?id={{itemId}}'